In [3]:
import pandas as pd
df=pd.read_csv('Employe.csv')
new_df=df.dropna()
print(df)
print("-----")
print(new_df)
print("------")
#print(new_df.to_string())
print("---")
s

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            NaN
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
7            NaN   NaN     NaN      NaN            NaN
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0
-----
   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0
------
---

NameError: name 's' is not defined

In [4]:
import pandas as pd
df=pd.read_csv('Employe.csv')
x=df.dropna(how="all")
print(x)

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            NaN
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [53]:
import pandas as pd
df = pd.read_csv('Employe.csv')
x = df["Age"].mean()
df["Age"].fillna(x, inplace = True)
print(df)

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            NaN
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
7            NaN  27.8     NaN      NaN            NaN
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [30]:
import pandas as pd
df=pd.read_csv('Employe.csv')
new_df=df.dropna()
print(nw_df)

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [20]:
df.dropna(subset=['Working hours'],inplace = True)

In [61]:
import pandas as pd
df=pd.read_csv("Employe.csv")
df.loc[6, 'Age']=45
print(df)

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            NaN
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  45.0  42,000      Amg           13.0
7            NaN   NaN     NaN      NaN            NaN
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [23]:
import pandas as pd
df=pd.read_csv('Employe.csv')
df.fillna(100,inplace=True)
print(df)

   Employee name    Age  Salary Category  Working hours
0       1.Ammani   25.0  30,000    Vipro            8.0
1      2.Sravani   18.0  18,000     Tata            9.0
2       3.Bhavya   22.0  22,000      Sve           10.0
3       4.Anusha   30.0  33,000    Motor          100.0
4       5.Monika   35.0  40,000      Tlc            8.0
5       6.Pavani   17.0  20,000      Cse           11.0
6      7.Lavanya   24.0  42,000      Amg           13.0
7            100  100.0     100      100          100.0
8      9.Kavitha   36.0  46,000      100            9.0
9      10.Nalini   45.0  50,000      Bmw            6.0
10      11.Kavya   26.0  24,000      Ded            9.0

In [7]:
import pandas as pd
df=pd.read_csv("Employe.csv")
df.isnull()

    Employee name    Age  Salary  Category  Working hours
0           False  False   False     False          False
1           False  False   False     False          False
2           False  False   False     False          False
3           False  False   False     False           True
4           False  False   False     False          False
5           False  False   False     False          False
6           False  False   False     False          False
7            True   True    True      True           True
8           False  False   False      True          False
9           False  False   False     False          False
10          False  False   False     False          False

In [63]:
df.isnull().sum()

Employee name    1
Age              1
Salary           1
Category         2
Working hours    2
dtype: int64

In [10]:
df.isnull().sum().sum()

7

In [14]:
import pandas as pd
df=pd.read_csv("Employe.csv")
print(df)

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            NaN
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
7            NaN   NaN     NaN      NaN            NaN
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [8]:
df=df.fillna(value=3)
print(df)

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            3.0
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
7              3   3.0       3        3            3.0
8      9.Kavitha  36.0  46,000        3            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [35]:
df=pd.read_csv("Employe.csv")
df.fillna("ammu",inplace=True)
print(df)

   Employee name   Age  Salary Category Working hours
0       1.Ammani  25.0  30,000    Vipro           8.0
1      2.Sravani  18.0  18,000     Tata           9.0
2       3.Bhavya  22.0  22,000      Sve          10.0
3       4.Anusha  30.0  33,000    Motor          ammu
4       5.Monika  35.0  40,000      Tlc           8.0
5       6.Pavani  17.0  20,000      Cse          11.0
6      7.Lavanya  24.0  42,000      Amg          13.0
7           ammu  ammu    ammu     ammu          ammu
8      9.Kavitha  36.0  46,000     ammu           9.0
9      10.Nalini  45.0  50,000      Bmw           6.0
10      11.Kavya  26.0  24,000      Ded           9.0

In [64]:
df.dropna(subset=["Working hours"],inplace=True)
print(df)

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  45.0  42,000      Amg           13.0
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [37]:
df=df.fillna(method='bfill')
print(df)

   Employee name   Age  Salary Category Working hours
0       1.Ammani  25.0  30,000    Vipro           8.0
1      2.Sravani  18.0  18,000     Tata           9.0
2       3.Bhavya  22.0  22,000      Sve          10.0
3       4.Anusha  30.0  33,000    Motor          ammu
4       5.Monika  35.0  40,000      Tlc           8.0
5       6.Pavani  17.0  20,000      Cse          11.0
6      7.Lavanya  24.0  42,000      Amg          13.0
7           ammu  ammu    ammu     ammu          ammu
8      9.Kavitha  36.0  46,000     ammu           9.0
9      10.Nalini  45.0  50,000      Bmw           6.0
10      11.Kavya  26.0  24,000      Ded           9.0

NameError: name 'data' is not defined

In [7]:
y=df.fillna(method="bfill",axis=1)
print(y)

   Employee name   Age  Salary Category Working hours
0       1.Ammani  25.0  30,000    Vipro           8.0
1      2.Sravani  18.0  18,000     Tata           9.0
2       3.Bhavya  22.0  22,000      Sve          10.0
3       4.Anusha  30.0  33,000    Motor           NaN
4       5.Monika  35.0  40,000      Tlc           8.0
5       6.Pavani  17.0  20,000      Cse          11.0
6      7.Lavanya  24.0  42,000      Amg          13.0
7            NaN   NaN     NaN      NaN           NaN
8      9.Kavitha  36.0  46,000      9.0           9.0
9      10.Nalini  45.0  50,000      Bmw           6.0
10      11.Kavya  26.0  24,000      Ded           9.0

In [6]:
x=df.dropna(how="any")
print(x)

  name  class    age subject  marks
0    a    1.0   10.0      cd    3.0
2    c    2.0   12.0      cd    4.0
3    d    3.0  130.0      wt    2.0
4    e    4.0   13.0     coa    7.0
7    g    6.0   16.0     ior    9.0

In [5]:
import pandas as pd
df=pd.read_csv("sample.csv")
df["age"].fillna(130,inplace=True)
print(df)

  name  class    age subject  marks
0    a    1.0   10.0      cd    3.0
1    b    NaN   11.0     dsp    6.0
2    c    2.0   12.0      cd    4.0
3    d    3.0  130.0      wt    2.0
4    e    4.0   13.0     coa    7.0
5    f    5.0   14.0      wt    NaN
6  NaN    NaN   15.0     NaN    NaN
7    g    6.0   16.0     ior    9.0
8    h    7.0   17.0     NaN    6.0

In [7]:
x=df["marks"].mean()
print(x)

5.285714285714286

In [8]:
x=df["marks"].max()
print(x)

9.0

In [9]:
x=df["age"].min()
print(x)

10.0

In [10]:
x=df["age"].median()
print(x)

14.0

In [11]:
df["marks"].fillna(x,inplace=True)
print(df)

  name  class    age subject  marks
0    a    1.0   10.0      cd    3.0
1    b    NaN   11.0     dsp    6.0
2    c    2.0   12.0      cd    4.0
3    d    3.0  130.0      wt    2.0
4    e    4.0   13.0     coa    7.0
5    f    5.0   14.0      wt   14.0
6  NaN    NaN   15.0     NaN   14.0
7    g    6.0   16.0     ior    9.0
8    h    7.0   17.0     NaN    6.0

In [15]:
df.loc[6,'name']="ammani"
print(df)

     name  class    age subject  marks
0       a    1.0   10.0      cd    3.0
1       b    NaN   11.0     dsp    6.0
2       c    2.0   12.0      cd    4.0
3       d    3.0  130.0      wt    2.0
4       e    4.0   13.0     coa    7.0
5       f    5.0   14.0      wt   14.0
6  ammani    NaN   15.0     NaN   14.0
7       g    6.0   16.0     ior    9.0
8       h    7.0   17.0     NaN    6.0

In [17]:
df=df.duplicated()
print(df)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [35]:
import pandas as pd
df=pd.read_csv("Employe.csv")
df.drop_duplicates(inplace=True)
print(df)

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            NaN
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
7            NaN   NaN     NaN      NaN            NaN
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [33]:
import pandas as pd

df = pd.read_csv('sample.csv')

df.drop_duplicates(inplace = True)

print(df.to_string())

  name  class   age subject  marks
0    a    1.0  10.0      cd    3.0
1    b    NaN  11.0     dsp    6.0
2    c    2.0  12.0      cd    4.0
3    d    3.0   NaN      wt    2.0
4    e    4.0  13.0     coa    7.0
5    f    5.0  14.0      wt    NaN
6  NaN    NaN  15.0     NaN    NaN
7    g    6.0  16.0     ior    9.0
8    h    7.0  17.0     NaN    6.0

In [58]:
import pandas as pd
df=pd.read_csv("Employe.csv")
df.dropna(subset=["Age"],inplace=True)
df

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            NaN
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0

In [36]:
import pandas as pd
df = pd.read_csv('Employe.csv')
df["Age"].fillna(100,inplace = True)
print(df)

AttributeError: 'NoneType' object has no attribute 'mean'

In [50]:
x=df["Age"].mean()
df["Age"].fillna(x,inplace=True)
print(df)

   Employee name    Age  Salary Category  Working hours
0       1.Ammani   25.0  30,000    Vipro            8.0
1      2.Sravani   18.0  18,000     Tata            9.0
2       3.Bhavya   22.0  22,000      Sve           10.0
3       4.Anusha   30.0  33,000    Motor            NaN
4       5.Monika   35.0  40,000      Tlc            8.0
5       6.Pavani   17.0  20,000      Cse           11.0
6      7.Lavanya   24.0  42,000      Amg           13.0
7            NaN  100.0     NaN      NaN            NaN
8      9.Kavitha   36.0  46,000      NaN            9.0
9      10.Nalini   45.0  50,000      Bmw            6.0
10      11.Kavya   26.0  24,000      Ded            9.0

In [55]:
df.dropna(subset=["Age"],inplace=True)
df

   Employee name   Age  Salary Category  Working hours
0       1.Ammani  25.0  30,000    Vipro            8.0
1      2.Sravani  18.0  18,000     Tata            9.0
2       3.Bhavya  22.0  22,000      Sve           10.0
3       4.Anusha  30.0  33,000    Motor            NaN
4       5.Monika  35.0  40,000      Tlc            8.0
5       6.Pavani  17.0  20,000      Cse           11.0
6      7.Lavanya  24.0  42,000      Amg           13.0
7            NaN  27.8     NaN      NaN            NaN
8      9.Kavitha  36.0  46,000      NaN            9.0
9      10.Nalini  45.0  50,000      Bmw            6.0
10      11.Kavya  26.0  24,000      Ded            9.0